<?php

use Illuminate\Database\Seeder;

class OrganizationTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('Organization')->insertOrIgnore([
          ['id' =>  1, 'Name' => 'กลุ่มสาระการเรียนรู้วิทยาศาสตร์และเทคโนโลยี'],
          ['id' =>  2, 'Name' => 'กลุ่มสาระการเรียนรู้คณิตศาสตร์'],
          ['id' =>  3, 'Name' => 'กลุ่มสาระการเรียนรู้ภาษาต่างประเทศ'],
          ['id' =>  4, 'Name' => 'กลุ่มสาระการเรียนรู้ภาษาไทย'],
          ['id' =>  5, 'Name' => 'กลุ่มสาระการเรียนรู้สังคมศึกษา ศาสนา และวัฒนธรรม'],
          ['id' =>  6, 'Name' => 'กลุ่มสาระการเรียนรู้สุขศึกษาและพลศึกษา'],
          ['id' =>  7, 'Name' => 'กลุ่มสาระการเรียนรู้ศิลปศึกษา'],
          ['id' =>  8, 'Name' => 'กลุ่มสาระการเรียนรู้การงานอาชีพ'],
          ['id' =>  9, 'Name' => 'กลุ่มกิจกรรมพัฒนาผู้เรียน'],
          ['id' => 10, 'Name' => 'กลุ่มบริหารวิชาการ'],
          ['id' => 11, 'Name' => 'กลุ่มบริหารทั่วไป'],
          ['id' => 12, 'Name' => 'กลุ่มบริหารบุคคล การเงิน และสินทรัพย์'],
          ['id' => 13, 'Name' => 'กลุ่มบริหารกิจการนักเรียน'],
          ['id' => 14, 'Name' => 'กลุ่มพัฒนาคุณภาพการศึกษา'],
          ['id' => 15, 'Name' => 'EPLUS'],
          ['id' => 16, 'Name' => 'สมาคมผู้ปกครองและครู']
        ]);
    }
}
